const smashCharacters = [
    "マリオ", "ドンキーコング", "リンク", "サムス", "ヨッシー",
    "カービィ", "フォックス", "ピカチュウ", "ルイージ", "ネス",
    "キャプテン・ファルコン", "プリン", "ピーチ", "デイジー",
    "クッパ", "アイスクライマー", "シーク", "ゼルダ", "ドクターマリオ",
    "ピチュー", "ファルコ", "マルス", "ルキナ", "こどもリンク",
    "ガノンドロフ", "ミュウツー", "ロイ", "クロム", "Mr.ゲーム＆ウォッチ",
    "メタナイト", "ピット", "ブラックピット", "ゼロスーツサムス",
    "ワリオ", "スネーク", "アイク", "ポケモントレーナー", "ディディーコング",
    "リュカ", "ソニック", "デデデ", "オリマー", "ルカリオ", "ロボット",
    "トゥーンリンク", "ウルフ", "むらびと", "ロックマン", "Wii Fit トレーナー",
    "ロゼッタ＆チコ", "リトル・マック", "ゲッコウガ", "パルテナ", "パックマン",
    "ルフレ", "シュルク", "クッパJr.", "ダックハント", "リュウ", "ケン",
    "クラウド", "カムイ", "ベヨネッタ", "インクリング", "リドリー", "シモン",
    "リヒター", "キングクルール", "しずえ", "ガオガエン", "パックンフラワー",
    "ジョーカー", "勇者", "バンジョー＆カズーイ", "テリー", "ベレト", "ミェンミェン",
    "スティーブ", "セフィロス", "ホムラ/ヒカリ", "カズヤ", "ソラ"
  ];
  