const weaponData = {
  "シューター": [
    "スプラシューター", "プロモデラー", "52ガロン", "96ガロン", "ジェットスイーパー", "N-ZAP", "シャープマーカー", "プライムシューター", "ボールドマーカー", "わかばシューター", "スペースシューター", "L3リールガン", "H3リールガン", "ボトルガイザー"
  ],
  "ローラー": [
    "スプラローラー", "ダイナモローラー", "カーボンローラー", "ヴァリアブルローラー", "ワイドローラー"
  ],
  "チャージャー": [
    "リッター4K", "スクイックリン", "ソイチューバー", "スプラスコープ", "14式竹筒銃", "スプラチャージャー", "4Kスコープ", "R-PEN/5H"
  ],
  "マニューバー": [
    "スパッタリー", "スプラマニューバー", "クアッドホッパー", "ケルビン525", "デュアルスイーパー", "ガエンFF"
  ],
  "フデ": [
    "パブロ", "ホクサイ", "フィンセント"
  ],
  "スロッシャー": [
    "バケットスロッシャー", "ヒッセン", "スクリュースロッシャー", "エクスプロッシャー", "オーバーフロッシャー", "モップリン"
  ],
  "ブラスター": [
    "ホットブラスター", "ノヴァブラスター", "クラッシュブラスター", "ラピッドブラスター", "ロングブラスター", "Rブラスターエリート", "S-BLAST",
  ],
  "スピナー": [
    "バレルスピナー", "ハイドラント", "クーゲルシュライバー", "ノーチラス", "スプラスピナー", "イグザミナー"
  ],
  "シェルター": [
    "スパイガジェット", "キャンピングシェルター", "パラシェルター", "24式張替傘"
  ],
  "ストリンガー": [
    "トライストリンガー", "LACT-450", "フルイドV"
  ],
  "ワイパー": [
    "ジムワイパー", "ドライブワイパー", "デンタルワイパー"
  ]

};
