const splatoonWeapons = [
  "スプラシューター", "プロモデラー", "52ガロン", "96ガロン", "ジェットスイーパー", "N-ZAP", "シャープマーカー", "プライムシューター", "ボールドマーカー", "わかばシューター", "スペースシューター", "L3リールガン", "H3リールガン", "ボトルガイザー",

  "スパッタリー", "スプラマニューバー", "クアッドホッパー", "ケルビン525", "デュアルスイーパー", "ガエンFF",
  
  "パブロ", "ホクサイ", "フィンセント",
  
  "スプラローラー", "ダイナモローラー", "カーボンローラー", "ヴァリアブルローラー", "ワイドローラー",

  "リッター4K", "スクイックリン", "ソイチューバー", "スプラスコープ", "14式竹筒銃", "スプラチャージャー", "4Kスコープ", "R-PEN/5H",

  "バケットスロッシャー", "ヒッセン", "スクリュースロッシャー", "エクスプロッシャー", "オーバーフロッシャー", "モップリン",

  "ホットブラスター", "ノヴァブラスター", "クラッシュブラスター", "ラピッドブラスター", "ロングブラスター", "Rブラスターエリート", "S-BLAST",
   
  "バレルスピナー", "ハイドラント", "クーゲルシュライバー", "ノーチラス", "スプラスピナー", "イグザミナー",

   "スパイガジェット", "キャンピングシェルター", "パラシェルター", "24式張替傘",

  "トライストリンガー", "LACT-450", "フルイドV",

  "ジムワイパー", "ドライブワイパー", "デンタルワイパー"
];